app/views/meetups/show.html.erb

<%=  @join.inspect %>
@meetup=Meetup.find(params[:id])%>
---
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 1 LIMIT 1