app/views/events/show.html.erb

  <tbody>
    <% @event.comments.each do |comment| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`event_id` = 1