app/controllers/events_controller.rb

  def index
    @meetup =Meetup.find(params[:meetup_id])
    @events = @meetup.events.all
---
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 4 LIMIT 1
SELECT `events`.* FROM `events` WHERE `events`.`meetup_id` = 4

  def show
      @meetup =Meetup.find(params[:meetup_id])
      @event  = @meetup.events.find(params[:id])
      @joinevent=Userevent.where("user_id = ? AND event_id = ?",session[:user_id],params[:id]).exists?
---
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 1 LIMIT 1
SELECT  `events`.* FROM `events` WHERE `events`.`meetup_id` = 3 AND `events`.`id` = 1 LIMIT 1
SELECT  1 AS one FROM `userevents` WHERE (user_id = 5 AND event_id = '1') LIMIT 1

  def create
    @meetup=Meetup.find(params[:meetup_id])
    @event =@meetup.events.new(event_params)

    respond_to do |format|
      if @event.save
---
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 13 LIMIT 1
INSERT INTO `events` (`title`, `body`, `date`, `meetup_id`, `created_at`, `updated_at`) VALUES ('first', 'first', '1998-03-02 00:00:00', 1, '2015-05-10 08:20:42', '2015-05-10 08:20:42')

  def join
    @meetup=Meetup.find(params[:meetup_id])
    @event =@meetup.events.find(params[:id])


    @userevent = Userevent.new(event_id:params[:id],  user_id:  session[:user_id])
    respond_to do |format|
      @userevent.save
---
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = NULL LIMIT 1
SELECT  `events`.* FROM `events` WHERE `events`.`meetup_id` = 16 AND `events`.`id` = 4 LIMIT 1
INSERT INTO `userevents` (`event_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 5, '2015-05-11 12:25:19', '2015-05-11 12:25:19')

def listevent
@meetup=Meetup.find(params[:meetup_id])

@events = Event.where("date >= ? AND meetup_id =?", params[:date]+' 00:00:00',@meetup)
---
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 13 LIMIT 1
SELECT `events`.* FROM `events` WHERE (date >= '2010-05-11 00:00:00' AND meetup_id =13)