app/controllers/meetups_controller.rb

SELECT `meetups`.* FROM `meetups`
SELECT `tags`.* FROM `tags`
SELECT `tagmeetups`.* FROM `tagmeetups`
---
  def index
    @meetups = Meetup.all
    @tags = Tag.all
    @tagmeetups = Tagmeetup.all

SELECT  1 AS one FROM `usermeetups` WHERE (user_id = 5 AND meetup_id = '13') LIMIT 1
SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 1 LIMIT 1
---
  def show
   @join=Usermeetup.where("user_id = ? AND meetup_id = ?",session[:user_id],params[:id]).exists?

SELECT `tags`.* FROM `tags`
---
  def new
    @meetup = Meetup.new
    @tagmeetup = Tagmeetup.new
    @tags = Tag.all

INSERT INTO `tags` (`title`, `created_at`, `updated_at`) VALUES ('reading', '2015-05-11 18:53:58', '2015-05-11 18:53:58')
INSERT INTO `meetups` (`title`, `user_id`, `disc`, `lat`, `long`, `country`, `created_at`, `updated_at`) VALUES ('xxxxxxx', 1, 'aaaaaaaaaaaaa', 31.1926962, 29.905866800000002, 'Egypt', '2015-05-11 13:50:41', '2015-05-11 13:50:41')
INSERT INTO `tagmeetups` (`tag_id`, `meetup_id`, `created_at`, `updated_at`) VALUES (1, 20, '2015-05-11 18:53:59', '2015-05-11 18:53:59')
---
  def create
    # params[:tag_id].split(",").each do |p|
  @tag = Tag.new(title:params[:title])
     @tag.save
#end
     @meetup = Meetup.new(meetup_params)
     @meetup.save
     params[:tag_id].split(",").each do |p|
     @tagmeetup  = Tagmeetup.new(tag_id:p,meetup_id:@meetup.id);
     @tagmeetup.save

UPDATE `meetups` SET `lat` = 31.192827500000003, `long` = 29.906136999999994, `updated_at` = '2015-05-11 13:25:36' WHERE `meetups`.`id` = 16
---
  def update
    respond_to do |format|
      if @meetup.update(meetup_params)

SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 5 LIMIT 1
INSERT INTO `usermeetups` (`meetup_id`, `user_id`, `created_at`, `updated_at`) VALUES (5, 1, '2015-05-10 20:44:40', '2015-05-10 20:44:40')
---
 def join

    @meetup=Meetup.find(params[:id])

    @usermeetup = Usermeetup.new(meetup_id:params[:id],  user_id:  session[:user_id])
    respond_to do |format|
      @usermeetup.save

SELECT  `meetups`.* FROM `meetups` WHERE `meetups`.`id` = 16 LIMIT 1
---
    def set_meetup
      @meetup = Meetup.find(params[:id])