app/controllers/semindex_controller.rb

def listevent
@events = Event.where("date >= ?", params[:date]+' 00:00:00')
---
SELECT `events`.* FROM `events` WHERE (date >= '2015-05-10 00:00:00')