app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `isadmin`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('iti', 'iti@meetup.com', '$2a$10$4UEHPiFuhOYv2vLYyxxTwODgcasWAwLlwXX3wlHFGunGInaTuqpKW', 1, '800px-ninja.jpg', 'image/jpeg', 29939, '2015-05-09 17:22:10', '2015-05-09 17:22:10', '2015-05-09 17:22:10')